In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [2]:
OUTPUT_PATH = os.path.join(os.getcwd(), 'cleaned')
FILE_PATH = os.path.join(os.getcwd(), 'uscities.csv')

In [3]:
df = pd.read_csv(FILE_PATH)

In [4]:
df.head()

,city,city_ascii,state_id,state_name,county_fips,county_name,lat,lng,population,density,source,military,incorporated,timezone,ranking,zips,id
0,New York,New York,NY,New York,36081,Queens,40.6943,-73.9249,18972871,10768.2,shape,False,True,America/New_York,1,11229 11226 11225 11224 11223 11221 11220 1138...,1840034016
1,Los Angeles,Los Angeles,CA,California,6037,Los Angeles,34.1141,-118.4068,12121244,3267.6,shape,False,True,America/Los_Angeles,1,90291 90293 90292 91316 91311 90035 90034 9003...,1840020491
2,Chicago,Chicago,IL,Illinois,17031,Cook,41.8375,-87.6866,8595181,4576.6,shape,False,True,America/Chicago,1,60018 60649 60641 60640 60643 60642 60645 6064...,1840000494
3,Miami,Miami,FL,Florida,12086,Miami-Dade,25.7840,-80.2101,5711945,4945.7,shape,False,True,America/New_York,1,33128 33129 33125 33126 33127 33149 33144 3314...,1840015149
4,Dallas,Dallas,TX,Texas,48113,Dallas,32.7935,-96.7667,5668165,1522.2,shape,False,True,America/Chicago,1,75287 75098 75234 75254 75251 75252 75253 7503...,1840019440

In [5]:
columns_to_keep = ['state_name', 'city_ascii', 'county_name', 'lat', 'lng']
df_col = df[columns_to_keep]

In [6]:
df_col.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30844 entries, 0 to 30843
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state_name   30844 non-null  object
 1   city_ascii   30844 non-null  object
 2   county_name  30844 non-null  object
 3   lat          30844 non-null  float64
 4   lng          30844 non-null  float64
dtypes: float64(2), object(3)
memory usage: 1.2+ MB

In [7]:
# Convert types
pd.options.mode.chained_assignment = None
df_col['state_name'] = df_col['state_name'].astype('string')
df_col['city_ascii'] = df_col['city_ascii'].astype('string')
df_col['county_name'] = df_col['county_name'].astype('string')
df_col.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30844 entries, 0 to 30843
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state_name   30844 non-null  string
 1   city_ascii   30844 non-null  string
 2   county_name  30844 non-null  string
 3   lat          30844 non-null  float64
 4   lng          30844 non-null  float64
dtypes: float64(2), string(3)
memory usage: 1.2 MB

In [8]:
# rename columns
df_col = df_col.rename(columns={'state_name':'state', 'city_ascii': 'city', 'county_name':'county'})
df_col.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30844 entries, 0 to 30843
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   30844 non-null  string
 1   city    30844 non-null  string
 2   county  30844 non-null  string
 3   lat     30844 non-null  float64
 4   lng     30844 non-null  float64
dtypes: float64(2), string(3)
memory usage: 1.2 MB

In [12]:
df_col.index = np.arange(1, len(df_col)+1)
df_col.head()

        state         city       county      lat       lng
1    New York     New York       Queens  40.6943  -73.9249
2  California  Los Angeles  Los Angeles  34.1141 -118.4068
3    Illinois      Chicago         Cook  41.8375  -87.6866
4     Florida        Miami   Miami-Dade  25.7840  -80.2101
5       Texas       Dallas       Dallas  32.7935  -96.7667

In [15]:
df_col = df_col.reset_index(names='city_id')
df_col.head()

   city_id       state         city       county      lat       lng
0        1    New York     New York       Queens  40.6943  -73.9249
1        2  California  Los Angeles  Los Angeles  34.1141 -118.4068
2        3    Illinois      Chicago         Cook  41.8375  -87.6866
3        4     Florida        Miami   Miami-Dade  25.7840  -80.2101
4        5       Texas       Dallas       Dallas  32.7935  -96.7667

In [16]:
df_col.to_csv(os.path.join(OUTPUT_PATH, "all_cities.csv"), index=True)

In [18]:
lat_long = df_col[['city_id', 'lat', 'lng']]
lat_long = lat_long.rename(columns={
    'lat':'latitude',
    'lng': 'longitude'
})

In [19]:
lat_long.to_csv("lat_long.csv", index=False)

In [ ]:
city = df_col[['city_id', '']]